# APS106 - Fundamentals of Computer Programming
## Week 12 | Lecture 1 (12.2) - More Pandas, Data Visualization

### This Week
| Lecture | Topics |
| --- | --- |
| 12.1 | Pandas |
| **12.2** | **More Pandas, Data Visualization** | 
| 12.3 | Design Problem: Stock Market, Part 1 |

### Lecture Structure
1. [Conditional Selection](#section1)
2. [Breakout Session 1](#section2)
3. [Adding, removing, and modifying columns](#section3)
4. [Utility Methods](#section4)
5. [String Methods](#section5)
6. [Concatentation](#section6)
7. [Breakout Session 2](#section7)
8. [Data Visualization](#section8)

<a id='section1'></a>
## 1. Conditional Selection
Let's start by importing `pandas`.

In [1]:
import pandas as pd

Now, let's import a new dataset of baby names in New York.

In [4]:
babynames = pd.read_csv('new_york_baby_names.csv')
babynames.head()

  State Sex  Year      Name  Count
0    NY   F  1910      Mary   1923
1    NY   F  1910     Helen   1290
2    NY   F  1910      Rose    990
3    NY   F  1910      Anna    951
4    NY   F  1910  Margaret    926

That way to read the table able is as follows. In the state of Ney York in 1910, 1923 babies of Female sex were born and given the name Mary.

Let's start off by grabbing a smaller sample of our dataset.

In [5]:
babynames_first_10_rows = babynames.loc[:9, :]
babynames_first_10_rows

  State Sex  Year      Name  Count
0    NY   F  1910      Mary   1923
1    NY   F  1910     Helen   1290
2    NY   F  1910      Rose    990
3    NY   F  1910      Anna    951
4    NY   F  1910  Margaret    926
5    NY   F  1910   Dorothy    897
6    NY   F  1910      Ruth    713
7    NY   F  1910   Lillian    648
8    NY   F  1910  Florence    604
9    NY   F  1910   Frances    589

By passing in a sequence (`list` or `Series`) of `boolean` values, we can extract a subset of the rows in a `DataFrame`. We will keep only the rows that correspond to a `boolean` value of `True`.

Let's first create a list of `booleans`. One requirement is that if we're created a list to filer the rows of a `DataFrame` then the `list` must have as many items in it as there are rows in the `DataFrame` we wantto filter. In this case, the `DataFrame` has **10** rows so the list must have **10** booleans.

In [20]:
boolean_list = [True, False, True, False, True, False, True, False, True, False]

Now, let's pass that list in as the first argument (row selection) in for the `.loc` method.

In [22]:
babynames_first_10_rows.loc[boolean_list, :]

  State Sex  Year      Name  Count
0    NY   F  1910      Mary   1923
2    NY   F  1910      Rose    990
4    NY   F  1910  Margaret    926
6    NY   F  1910      Ruth    713
8    NY   F  1910  Florence    604

As you can see above, we had placed `True` at the position of all even indices in the `list` and therefore, only rows with an even index are returned.

Oftentimes, we'll use boolean selection to check for entries in a `DataFrame` that meet a particular condition. In the code below, we first selectiong a column, which returns a `Series`.

In [11]:
babynames.loc[:, 'Sex']

0         F
1         F
2         F
3         F
4         F
         ..
314088    M
314089    M
314090    M
314091    M
314092    M
Name: Sex, Length: 314093, dtype: object

In the code below, we are using a logical condition to generate a boolean `Series`.

In [14]:
babynames.loc[:, 'Sex'] == "F"

0          True
1          True
2          True
3          True
4          True
          ...
314088    False
314089    False
314090    False
314091    False
314092    False
Name: Sex, Length: 314093, dtype: bool

Let's save this as a variable.

In [18]:
boolean_series = babynames.loc[:, 'Sex'] == "F"

Now we can pass this `boolean` `Series` into `.loc` as the first argument (row selection). This will return a `DataFrame` where only the Female baby names will be returned.

In [19]:
babynames.loc[boolean_series, :]

       State Sex  Year      Name  Count
0         NY   F  1910      Mary   1923
1         NY   F  1910     Helen   1290
2         NY   F  1910      Rose    990
3         NY   F  1910      Anna    951
4         NY   F  1910  Margaret    926
...      ...  ..   ...       ...    ...
178835    NY   F  2022     Zella      5
178836    NY   F  2022       Zen      5
178837    NY   F  2022      Ziah      5
178838    NY   F  2022    Zinnia      5
178839    NY   F  2022      Zori      5

[178840 rows x 5 columns]

As you can see from the print out above, only Female baby names are present in the resultant `DataFrame`. Let's check out the size of the original `DataFrame` and the one after select for only `sex == Female` baby names.

In [25]:
print("The original DataFrame has: ", baby_names.shape[0], " rows.", sep='')
print("The 'Female' filtered DataFrame has: ", babynames.loc[boolean_series, :].shape[0], " rows.", sep='')

The original DataFrame has: 314093 rows.
The 'Female' filtered DataFrame has: 178840 rows.

Rather than creating a separate variable `boolean_series` for the `boolean` `Series`, we can pass the logical condition into `.loc` as the first argument (row selection).

In [26]:
babynames.loc[babynames.loc[:, 'Sex'] == "F", :]

       State Sex  Year      Name  Count
0         NY   F  1910      Mary   1923
1         NY   F  1910     Helen   1290
2         NY   F  1910      Rose    990
3         NY   F  1910      Anna    951
4         NY   F  1910  Margaret    926
...      ...  ..   ...       ...    ...
178835    NY   F  2022     Zella      5
178836    NY   F  2022       Zen      5
178837    NY   F  2022      Ziah      5
178838    NY   F  2022    Zinnia      5
178839    NY   F  2022      Zori      5

[178840 rows x 5 columns]

Lastly, let's show that the number of rows for the `sex == Female` `DataFrame` and the `sex == Male` `DataFrame` add up to the original size of the `babynames` `DataFrame`.

In [28]:
print("The original DataFrame has: ", baby_names.shape[0], " rows.", sep='')
print("The 'Female' filtered DataFrame has: ", babynames.loc[babynames.loc[:, 'Sex'] == "F", :].shape[0], " rows.", sep='')
print("The 'Male' filtered DataFrame has: ", babynames.loc[babynames.loc[:, 'Sex'] == "M", :].shape[0], " rows.", sep='')
print(babynames.loc[babynames.loc[:, 'Sex'] == "F", :].shape[0], " + ", babynames.loc[babynames.loc[:, 'Sex'] == "M", :].shape[0], " = ", baby_names.shape[0], sep='')

The original DataFrame has: 314093 rows.
The 'Female' filtered DataFrame has: 178840 rows.
The 'Male' filtered DataFrame has: 135253 rows.
178840 + 135253 = 314093

### Multiple Conditions
To filter on multiple conditions, we combine boolean operators using bitwise comparisons.

| Symbol | Usage | Meaning |
| --- | --- | --- |
| ~ | ~p | not p |
| &#124; | p &#124; q | p or q |
| & | p & q | p and q |

The code below is filtering the `babynames` `DataFrame` to only include **Female** baby names for all years before the year **2000**.

In [33]:
babynames.loc[(babynames["Sex"] == "F") & (babynames["Year"] < 2000), :]

       State Sex  Year      Name  Count
0         NY   F  1910      Mary   1923
1         NY   F  1910     Helen   1290
2         NY   F  1910      Rose    990
3         NY   F  1910      Anna    951
4         NY   F  1910  Margaret    926
...      ...  ..   ...       ...    ...
121260    NY   F  1999     Yusra      5
121261    NY   F  1999     Zaira      5
121262    NY   F  1999  Zakiyyah      5
121263    NY   F  1999    Zaniya      5
121264    NY   F  1999     Ziona      5

[121265 rows x 5 columns]

The code below is filtering the `babynames` `DataFrame` to include all baby names that are either **Female** or from before the year **2000**.

In [32]:
babynames.loc[(babynames["Sex"] == "F") | (babynames["Year"] < 2000), :]

       State Sex  Year      Name  Count
0         NY   F  1910      Mary   1923
1         NY   F  1910     Helen   1290
2         NY   F  1910      Rose    990
3         NY   F  1910      Anna    951
4         NY   F  1910  Margaret    926
...      ...  ..   ...       ...    ...
267531    NY   M  1999   Yiannis      5
267532    NY   M  1999      Zaid      5
267533    NY   M  1999    Zavier      5
267534    NY   M  1999    Zavion      5
267535    NY   M  1999      Zuri      5

[267536 rows x 5 columns]

The code below is filtering the `babynames` `DataFrame` to include **Female** baby names from the year **2000** that were given to less than **6** babies that year.

In [48]:
babynames[(babynames["Sex"] == "M") & (babynames["Year"] == 2020) & (babynames["Count"] < 6)]

       State Sex  Year        Name  Count
309726    NY   M  2020  Abdirahman      5
309727    NY   M  2020  Abdurahman      5
309728    NY   M  2020    Abubakar      5
309729    NY   M  2020        Adil      5
309730    NY   M  2020     Adonnis      5
...      ...  ..   ...         ...    ...
309955    NY   M  2020         Zac      5
309956    NY   M  2020        Zach      5
309957    NY   M  2020   Zacharias      5
309958    NY   M  2020     Zayvion      5
309959    NY   M  2020        Zyan      5

[234 rows x 5 columns]

The code below is filtering the `babynames` `DataFrame` to include **Female** baby names from the year **2000** that were given to more than **700** babies that year.

In [47]:
babynames[(babynames["Sex"] == "M") & (babynames["Year"] == 2020) & (babynames["Count"] > 700)]

       State Sex  Year      Name  Count
308011    NY   M  2020      Liam   1360
308012    NY   M  2020      Noah   1236
308013    NY   M  2020     Lucas    913
308014    NY   M  2020     Jacob    879
308015    NY   M  2020    Joseph    819
308016    NY   M  2020     Ethan    803
308017    NY   M  2020   Michael    784
308018    NY   M  2020  Benjamin    731
308019    NY   M  2020     James    708

### Membership Condition
We can use `.isin` for Selection based on a list or Series. For example, let's way we wantto create a dictionary that only contains the names `"Sebastian"`, `"Ben"`, `"Joseph"`, `"Katia"`, and `"Tamara"`. Based on what we've learned so far, I could do the following.

In [50]:
babynames[(babynames["Name"] == "Sebastian") | \
          (babynames["Name"] == "Ben") | \
          (babynames["Name"] == "Joseph") | \
          (babynames["Name"] == "Katia") | \
          (babynames["Name"] == "Tamara")]

       State Sex  Year       Name  Count
862       NY   F  1911     Joseph      6
2456      NY   F  1914     Joseph      9
3084      NY   F  1915     Joseph     12
3828      NY   F  1916     Joseph     11
4522      NY   F  1917     Joseph     15
...      ...  ..   ...        ...    ...
309992    NY   M  2021  Sebastian    443
310553    NY   M  2021        Ben     25
312024    NY   M  2022     Joseph    731
312046    NY   M  2022  Sebastian    475
312431    NY   M  2022        Ben     40

[564 rows x 5 columns]

A more concise method to achieve the above is by using the `.isin` method. The .`isin` method in Pandas is used to check whether each element in a `DataFrame` or `Series` is contained in a sequence of values. Here's how it works:

In [52]:
names = ["Sebastian", "Ben", "Joseph", "Katia", "Tamara"]
babynames.loc[:, "Name"].isin(names)

0         False
1         False
2         False
3         False
4         False
          ...
314088    False
314089    False
314090    False
314091    False
314092    False
Name: Name, Length: 314093, dtype: bool

We get back a `Series` where the value is `True` if the `"Name"` is in the list `names` and `False` if its not. We can take this `boolean` `Series` and pass it to the first argument the `.loc` method (row selection).

In [53]:
babynames.loc[babynames.loc[:, "Name"].isin(names), :]

       State Sex  Year       Name  Count
862       NY   F  1911     Joseph      6
2456      NY   F  1914     Joseph      9
3084      NY   F  1915     Joseph     12
3828      NY   F  1916     Joseph     11
4522      NY   F  1917     Joseph     15
...      ...  ..   ...        ...    ...
309992    NY   M  2021  Sebastian    443
310553    NY   M  2021        Ben     25
312024    NY   M  2022     Joseph    731
312046    NY   M  2022  Sebastian    475
312431    NY   M  2022        Ben     40

[564 rows x 5 columns]

<a id='section2'></a>
## 2. Breakout Session 1
Let's create a `Node`.

<a id='section3'></a>
## 3. Adding, removing, and modifying columns
Let's create a `Node`.

<a id='section4'></a>
## 4. Utility Methods
Let's create a `Node`.

<a id='section5'></a>
## 5. String Methods
Let's create a `Node`.

<a id='section6'></a>
## 6. Concatenation
In the lecture folder, there are six `.csv` files from **Uber** showing monthly ridership numbers from April 2014 to September 2014.

Given what we've learned aleady in Lectures 12.1, we know how to import these `.csv` files to **Pandas** `DataFrames`. Lets try that.

In [ ]:
april_data = pd.read_csv('uber-raw-data-apr14.csv')
may_data = pd.read_csv('uber-raw-data-may14.csv')
june_data = pd.read_csv('uber-raw-data-jun14.csv')
july_data = pd.read_csv('uber-raw-data-jul14.csv')
aug_data = pd.read_csv('uber-raw-data-aug14.csv')
sept_data = pd.read_csv('uber-raw-data-sep14.csv')

Let's see what the April data looks like.

In [ ]:
april_data.head()

In this DataFrame, each row is an Uber trip

Suppose we're asked to plot the number of trips per hour from April 2014 to September 2014. To tackle this problem, it would be much easier if all the data was in one DataFrame.

In the following section, you'll be introduces to two Pandas methods for combining DataFrames: `.concatenate()` and `.merge()`. The figure below is helpful for figuring out which method to use.

<br>
<img src="images/merging_dataframes.png" alt="drawing" width="750"/>
<br>

### Concatenate

We use the `.concat()` function to append either columns or rows from one DataFrame to another. This happens to be the functionality we need to handle the Uber data we import above.

[`pd.concat()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html) has many features, which you're encouraged to explore, but the basic function is demonstrated below.

If we look at the flow diagram above, if we want to stack multiple DataFrames side-by-side, then we set `axis=1`.

In [ ]:
# Stack the DataFrames on top of each other
uber_data = pd.concat([april_data, 
                       may_data, 
                       june_data, 
                       july_data, 
                       aug_data, 
                       sept_data], axis=1)

# View combined DataFrame
uber_data.head()

However, this is not what we want to do with the Uber data. We'd like to stack the data from each month, one on top of each other from April to September. To accomplish this, we need to set `axis=0`. Note that the order of the months in the DataFrame (top to bottom) follows the order of months in the `.concat()` method, left to right.

In [ ]:
# Stack the DataFrames on top of each other
uber_data = pd.concat([april_data, 
                       may_data, 
                       june_data, 
                       july_data, 
                       aug_data, 
                       sept_data], axis=0)

# View combined DataFrame
uber_data.head()

We can see April data dat the top of the DataFrame

In [ ]:
uber_data.tail()

and September data at the bottom.

Next, let's plot the index of our new DataFrame `uber_data` and inspect.

In [ ]:
import matplotlib.pylab as plt
plt.plot(uber_data.index)
plt.show()

We can clearly see from the plot that when concatenating the DataFrames, the original indexes have been preserved, meaning that we have duplicates, which will be an issue moving forward. 

To adjust the row index automatically, we have to set the argument `ignore_index` as `True` while calling the `.concat()` function.

In [ ]:
uber_data = pd.concat([april_data, 
                       may_data, 
                       june_data, 
                       july_data, 
                       aug_data, 
                       sept_data], 
                      axis=0,
                      ignore_index=True)

plt.plot(uber_data.index)
plt.show()

Now each row has a unique index!

The `.concat()` function has many more features that you should definitely [check out](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html).

In [ ]:
uber_data = pd.read_csv('uber-raw-data-jun14.csv')
uber_data = uber_data.set_index('Date/Time')
uber_data.index = pd.DatetimeIndex(uber_data.index)
counts = uber_data.index.value_counts().resample('H').sum()

<a id='section7'></a>
## 7. Breakout Session 2
Let's create a `Node`.

<a id='section8'></a>
## 8. Data Visualization
Let's create a `Node`.